<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件
$web = array (
	//网站名称
	'WebName'			=>	'Bao博客网站',
	//网站关键字
	'keyword' 			=>	'Bao个人博客,Bao,个人技术博客,个人博客,博客',
	//网站描述
	'description'		=>	'Bao博客是是个个人笔记记录网站，目的是记录自己在学习编程过程中遇到的一些问题，以及详细的解决方案，给予后人一个免费的参考。本人菜鸟一个，所以文章仅供参考哦！',
	//底部版权
	'copyRight'			=>	'EchoBao个人博客',
	//备案信息
	'beian'				=>	'粤ICP备18141770号-1',
);

$cates = \think\Db::name('cate')->select();
//执行成功赋值，不成功报错
if($cates){
	$web['cates'] = $cates;
}else{
	$web['cates'] = '导航条获取出错！';
}

\think\View::share('web',$web);